GBenG/STM32U599J-DK/Sandbox/VL53L5CX/Core/Src/main.c
  return ch;
}

void get_data_by_interrupt(VL53L5CX_Configuration *p_dev){
	do
	{
		__WFI();	// Wait for interrupt
		if(IntCount !=0 ){
			IntCount=0;
			status = vl53l5cx_get_resolution(p_dev, &resolution);
			status = vl53l5cx_get_ranging_data(p_dev, &Results);

			for(int i = 0; i < resolution;i++){
				/* Print per zone results */
				printf("Zone : %2d, Nb targets : %2u, Ambient : %4lu Kcps/spads, ",
						i,
						Results.nb_target_detected[i],
						Results.ambient_per_spad[i]);

				/* Print per target results */
				if(Results.nb_target_detected[i] > 0){
					printf("Target status : %3u, Distance : %4d mm\n",
							Results.target_status[VL53L5CX_NB_TARGET_PER_ZONE * i],
							Results.distance_mm[VL53L5CX_NB_TARGET_PER_ZONE * i]);
				}else{
					printf("Target status : 255, Distance : No target\n");
				}
			}
			printf("\n");
		}
	}while(1);
}


void get_data_by_polling(VL53L5CX_Configuration *p_dev){
//	do
//	{
		status = vl53l5cx_check_data_ready(&Dev, &p_data_ready);
		if(p_data_ready){
			status = vl53l5cx_get_resolution(p_dev, &resolution);
			status = vl53l5cx_get_ranging_data(p_dev, &Results);

			for(int i = 0; i < resolution;i++){
				/* Print per zone results */
//				printf("Zone : %2d, Nb targets : %2u, Ambient : %4lu Kcps/spads, ",
//						i,
//						Results.nb_target_detected[i],
//						Results.ambient_per_spad[i]);

				//printf("[%2d]\t0x%.2X\t%4d\n",i,
				printf("%d\t%d\t%d\n",i,
						Results.target_status[VL53L5CX_NB_TARGET_PER_ZONE * i],
						Results.distance_mm[VL53L5CX_NB_TARGET_PER_ZONE * i]);

				/* Print per target results */
//				if(Results.nb_target_detected[i] > 0){
//					printf("Target status : %3u, Distance : %4d mm\n",
//							Results.target_status[VL53L5CX_NB_TARGET_PER_ZONE * i],
//							Results.distance_mm[VL53L5CX_NB_TARGET_PER_ZONE * i]);
//				}else{
//					printf("Target status : 255, Distance : No target\n");
//				}
			}
			//printf("\n");
		}else{
			HAL_Delay(5);
		}
//	}
//	while(1);
}
/* USER CODE END 4 */

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
